Revit 2026 API

# SurfaceNdfType Enumeration

---

The enumerated type representing the permitted values for the asset property "SurfaceNdfType" from the "AdvancedLayered" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum SurfaceNdfType
```
```vb
Public Enumeration SurfaceNdfType
```
```cpp
public enum class SurfaceNdfType
```
```fsharp
type SurfaceNdfType
```

| Member name | Value | Description |
| --- | --- | --- |
| Beckmann | 0 |  |
| Ggx | 1 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace